const attractionsArray = [
  {
    id: 0,
    title: "Нижегородский Кремль",
    about: `Нижний Новгород, как и любой из оплотов русских князей, должен был соответствовать этому статусу. Одним из главных атрибутов для таких городов являлись оборонительные укрепления, кои на Руси назывались кремлями. Первое подобие крепости появилось ещё в 1221 году, когда город был основан великим князем Юрием Всеволодовичем. Утверждается, что эти укрепления сгорели в начале XV века во время набегов со стороны Казанского ханства, и примерно тогда же началось строительство каменного кремля, который мы видим сейчас.
        Конечно, за 500 лет Нижегородский Кремль неоднократно перестраивали, расширяли и реставрировали. В XVII веке он потерял оборонное значение, а какой-никакой ремонт решили сделать лишь в конце XIX. Тогда Кремль выкрасили в белый цвет и открыли в качестве музея. Уже к середине следующего века крепость находилась в весьма плачевном состоянии, в связи с чем началась масштабная реставрация, в ходе которой восстановили башни и прежний красный цвет.`,

    img: "https://avatars.dzeninfra.ru/get-zen_doc/2408175/pub_5fb12ee41064d30b6c0dd7aa_61c9d424e1097767d4591996/scale_1200",
    map: `<iframe src="https://yandex.ru/map-widget/v1/?um=constructor%3A4fca625d094ee09a9ef17ca7f2dd166d84f6404c5ee3bb72c5ca4bac057a7831&amp;source=constructor" width="100%" height="400" frameborder="0"></iframe>`,
  },
  {
    id: 1,
    title: "Михайло-Архангельский собор",
    about: `История Михайло-Архангельского собора началась одновременно с историей Нижнего Новгорода в 1221 году. Изначально это был деревянный храм, а в 1227 его перестроили полностью из камня. Сейчас же мы можем наблюдать здание 1359 года, возникшее в ходе коренной перестройки. Конечно, и оно неоднократно видоизменялось и, как полагается храму с богатым прошлым, неоднократно горело. В 1704 году случился последний пожар: огонь от Кремля перекинулся на собор, в результате чего тот серьезно пострадал. Понадобилось почти 30 лет, чтобы восстановить его и возобновить службы. При Советском Союзе с храмом обошлись бережно, а после реставрации в 1962 году внутри разместили прах Кузьмы Минина. Сегодня в соборе проводятся богослужения, а сам он является одним из главных зданий в ансамбле Нижегородского Кремля.`,
    img: "https://cont.ws/uploads/pic/2019/12/Миха́йло-Арха́нгельский%20собор%20—%20Древнейший%20каменный%20храм%20Нижнего%20Новгорода%20%2817%20в.%29.jpg",
    map: `<iframe src="https://yandex.ru/map-widget/v1/?um=constructor%3Ad838b454ced3183daa748a5e791505f3a401266e2ad2ed00ac6fb29c532f991c&amp;source=constructor" width="100%" height="400" frameborder="0"></iframe>`,
  },
  {
    id: 2,
    title: "Нижегородский государственный художественный музей",
    about: `В 1894 году живописец и профессор местной художественной академии Николай Кошелев совместно с единомышленниками подал прошение об организации художественного музея в городе. Просьба была удовлетворена и уже через 2 года в одной из башен Нижегородского Кремля открылась выставка работ русских художников. С тех пор музей не раз менял своё местоположение, а окончательно экспозицию разместили в Губернаторском доме. Это здание построили в середине XIX века на территории Нижегородского кремля по приказу Николая I. Сегодня художественный музей может похвастаться работами именитых живописцев, скульпторов и графиков со всего мира: Репин, Шишкин, Рерих, Левитан, Милле, Белотто, Йорданс и ещё десятки других всемирно известных фамилий. Определенно, все любители искусства останутся в восторге после посещения Нижегородского художественного музея.`,
    img: "https://img.tourister.ru/files/2/5/9/8/7/0/0/8/original.jpg",
    map: `<iframe src="https://yandex.ru/map-widget/v1/?um=constructor%3A8e8ecd768f64d1381531cffd524fda1d0525f4d72e195fa5b4b0407c8ef308c7&amp;source=constructor" width="100%" height="400" frameborder="0"></iframe>`,
  },
  {
    id: 3,
    title: "Набережная Федоровского",
    about: `Император Николай I был известен своей любовью к благоустройству и порядку в городах, поэтому виды Нижнего Новгорода его разочаровали. Особое внимание он обратил на набережную, где красивейшие пейзажи соседствовали с абсолютной неблагоустроенностью. Государь приказал составить план по обустройству города и взял его реализацию под собственный контроль.
    Одной из первых благоустроенных территорий стала набережная, где работал фуникулер и были разбиты аллеи для прогулок. Современный вид, как и название в честь ученого Николая Федоровского, набережная получила при СССР. Место быстро полюбилось всем любителям красивых пейзажей, ведь отсюда открывались великолепные виды на город. Не испортились они и сегодня, а набережная после реконструкции стала только лучше.`,
    img: "http://img-forum2.ners.ru/upload/59/5943146f424490cce4f6bf3ea1a1df11.jpg",
    map: `<iframe src="https://yandex.ru/map-widget/v1/?um=constructor%3Aa2296c11fbf07e35f2f224a7694523dc3bc4849bb6562e6063bfe2426eb2b352&amp;source=constructor" width="100%" height="400" frameborder="0"></iframe>`,
  },
  {
    id: 4,
    title: "Собор Святого Александра Невского",
    about: `Собор Святого Александра Невского — собор Русской православной церкви, расположенный в Канавинском районе. Он является одним из неофициальных символов Нижнего Новгорода, наряду с Дмитровской башней Кремля и Чкаловской лестницей.
    Строительство собора началось 18 августа 1868 года и длилось 13 лет. 20 июля 1881 года он был достроен и торжественно освящен в присутствии императора Александра III, его супруги Марии Федоровны и царевича Николая. Высота храма составляет 87 метров. В соборном дворе стоит третий по величине колокол в России высотой 4 метра.
    `,
    img: "https://live.staticflickr.com/65535/49630954177_a2d66d24e8_b.jpg",
    map: `<iframe src="https://yandex.ru/map-widget/v1/?um=constructor%3A67b2a699bc462b7af6a16e686347766d84b89fc1867fdccda9fa2a9deca66017&amp;source=constructor" width="100%" height="400" frameborder="0"></iframe>`,
  },
  {
    id: 5,
    title: "Чкаловская лестница",
    about: `Чкаловская лестница — это самая длинная лестница в России. Построенная в советское время, массивная конструкция вызывала споры из-за монументальной стоимости, а также использования немецких военнопленных в качестве рабочей силы. Сегодня лестница стала одной из самых популярных достопримечательностей Нижнего Новгорода. Чтобы попасть на вершину, нужно подняться по 560 ступенькам.
    Лестница названа в честь Валерия Чкалова, чей памятник находится на вершине. Он был высококвалифицированным советским летчиком-испытателем, родившимся недалеко от Нижнего Новгорода. К сожалению, 15 декабря 1938 года он погиб во время первого полета И-180 «Поликарпова».`,
    img: "https://ozernyi-sochi.ru/wp-content/uploads/d/6/b/d6b23087ea5a31d5bc91e97e7912f13b.jpeg",
    map: `<iframe src="https://yandex.ru/map-widget/v1/?um=constructor%3A628f9d5d1bc1643310ce7aed846de9a7f642bde6cd8e719dc772164909d9ba0e&amp;source=constructor" width="100%" height="400" frameborder="0"></iframe>`,
  },
  {
    id: 6,
    title: "Усадьба Рукавишниковых",
    about: `История усадьбы рода Рукавишниковых началась в первой половине XIX века. Тогда набережная активно застраивалась, а одной из построек стал дом небогатого купца Серапиона Везломцева. В 1868 году его приобретает мануфактурщик Михаил Рукавишников, но вскоре умирает, после чего дом достается сыну. Существующее здание увеличили и решили перестроить в стиле популярной тогда эклектики, которая служила не столько созданию красивого архитектурного ансамбля, сколько демонстрации богатства и могущества купеческого рода Рукавишниковых. Архитекторы и строители справились с этой задачей на отлично, ведь от богатства и красоты усадьбы легко получить восторг даже сегодня. Роскошные интерьеры, щедро декорированные лепниной, просторные залы с изысканной мебелью, разнообразие скульптур в фасаде — всё это заставит восхищаться снова и снова.`,
    img: "https://s9.travelask.ru/uploads/hint_place/000/114/374/image/af3553ad2bfbf8f15a10cb587f96179a.jpg",
    map: `<iframe src="https://yandex.ru/map-widget/v1/?um=constructor%3A6832fc316e543052b6b972cffe78a5da318ea02c94ce94e997eb18073a611f91&amp;source=constructor" width="100%" height="400" frameborder="0"></iframe>`,
  },
  {
    id: 7,
    title: "Музей истории ОАО «ГАЗ»",
    about: `С 1932 по 1990 Нижний Новгород назывался Горьким, поэтому ГАЗ расшифровывается никак иначе, как «Горьковский автомобильный завод». Именно здесь выпускались одни из лучших моделей отечественного автопрома: «Газель», «Волга», «Победа» и знаменитая «Чайка». ОАО «ГАЗ» занимается производством автомобилей и по сей день, но классические модели уже давно сняты с конвейера и являются лишь частью истории. Познакомиться с этой историей поближе вы можете в музее, посвященному развитию завода. Среди сотен экспонатов вы подробно узнаете о том, как зарождалось предприятие, кто принимал участие в создании первых автомобилей, увидите жизнь простых рабочих и, конечно же, весь модельный ряд ГАЗ. Каждый автомобиль имеет свою историю, а некоторые из них пришлось добывать немалыми усилиями и ценой длительных поисков по всей стране.`,
    img: "https://s0.rbk.ru/v6_top_pics/media/img/3/19/346874199561193.jpeg",
    map: `<iframe src="https://yandex.ru/map-widget/v1/?um=constructor%3Ab3b8f6d54f428a6c674cc1d06b9af986298b4245c39a4df50de2bcd0fad33ed5&amp;source=constructor" width="100%" height="400" frameborder="0"></iframe>`,
  },
  {
    id: 8,
    title: "Здание Государственного банка",
    about: `Нижегородский Государственный Банк — памятник архитектуры в неорусском стиле, похожий на сказочный замок. Он был построен в 1911–1913 годах в честь 300-летия царствования дома Романовых. Здание расположено в верхней части улицы Большая Покровская, недалеко от Кремля.
    Ансамбль включает в себя главный корпус, жилой дом для сотрудников, кованый забор с воротами, колокольню с часами и кладовую. Здание используется по прямому назначению, в нем размещается Нижегородское центральное управление Центрального банка России.`,
    img: "https://avatars.dzeninfra.ru/get-zen_doc/2468786/pub_5fb12ee41064d30b6c0dd7aa_61c9d70c8a61e92bc6ed35c7/scale_1200",
    map: `<iframe src="https://yandex.ru/map-widget/v1/?um=constructor%3Ad6e4c0a45e4e147445d17efd3d30dec58bd029047e0241b7f251840658e0bce1&amp;source=constructor" width="100%" height="400" frameborder="0"></iframe>`,
  },
  {
    id: 9,
    title: "Нижегородская ярмарка",
    about: `Нижний Новгород на протяжении нескольких веков был известен, как главный центр торговли на Руси. Именно здесь проходили крупнейшие ярмарки, богатейшие купцы строили дома, а какими суммами оперировали предприниматели даже трудно представить. Один из основных районов, где исторически кипела торговля — это Нижегородская ярмарка, расположенная на левом берегу Оки. Всё начиналось с деревянных лавок, которые быстро ветшали и портили облик города, а в период расцвета, приходящегося на середину XIX века, здесь возник роскошный архитектурный ансамбль. Увы, далеко не все постройки сохранились, но самая главная — ярмарочный дом — находится в отличном состоянии. Сейчас на Нижегородской ярмарке торговля не ведется, зато комплекс зданий переоборудовали в выставочный центр, который с легкостью может посоревноваться с ВДНХ в Москве и «Ленэкспо» в Санкт-Петербурге. Различные мероприятия, выставки и конференции проходят здесь регулярно: возможно и вам что-нибудь приглянется во время посещения.`,
    img: "https://sun9-2.userapi.com/impg/DZ84wksS5raoULtporAp4xZw7i6AIo1wYMQSQA/b02AX2EKFyY.jpg?size=1217x912&quality=95&sign=313b2b3e113454db3e71d478435833cc&c_uniq_tag=542KWEFPyQhmRiumgOZPrbFxzrjdESTlxsLMP2bCjGg&type=album",
    map: `<iframe src="https://yandex.ru/map-widget/v1/?um=constructor%3A2c61a14853129473359a502e001d2d17d70e9f65b81131c4c306b1a57597315b&amp;source=constructor" width="100%" height="400" frameborder="0"></iframe>`,
  },
];

const card = document.querySelector("#card");
const modal = document.querySelector("#modal");

attractionsArray.forEach((elem) => {
  card.insertAdjacentHTML(
    "beforeend",
    `
    <div class="card col-4 p-3" >
    <div class="card-img-content">
        <img src="${elem.img}" class="section-img" alt="...">
    </div>
    <div class="card-body">
        <h5 class="card-title">${elem.title}</h5>
        <a href="#" class="btn btn-primary" data-bs-toggle="modal"  data-bs-target="#modal-${elem.id}">Узнать больше</a>
    </div>
    </div>
  `
  );
});

attractionsArray.forEach((elem) => {
  modal.insertAdjacentHTML(
    "beforeend",
    `
    <div class="modal fade" id="modal-${elem.id}" data-bs-backdrop="static">
    <div class="modal-dialog container">
      <div class="modal-content ">
        <div class="modal-header">
          <h1 class="modal-title fs-5" id="staticBackdropLabel">${elem.title}</h1>
          <button type="button" class="btn-close" data-bs-dismiss="modal" aria-label="Закрыть"></button>
        </div>
        <div class="modal-body row">
            <div class="col-12 col-lg-6">
            <h3 class="h3 mb-4">История</h3>
            ${elem.about}
            </div>
            <div class="col-12 col-lg-6">
            <img src="${elem.img}" class="section-img" />
            </div>
            <div class="col-12">
            <h3 class="h3 mb-4">Расположение: </h3>
                ${elem.map}
            </div>
        </div>
        <div class="modal-footer">
          <button type="button" class="btn btn-primary" data-bs-dismiss="modal">Закрыть</button>
        </div>
      </div>
    </div>
    `
  );
});
